---
layout: default
title: 作品ページ
---

# 作ったゲーム一覧
上の方が新しいゲームになります。  
今後、スマートフォンとsteamにゲームを出すことを計画しています。（現在はスマートフォンゲームを作成中（学生の内にしかできないことをやろうと思ってマネタイズを度外視して作ってます。））

## [MECHADOOM](https://bitsummit-gamejam.itch.io/mechadoom)

BitSummitGameJamに参加し、チーム制作をした「MechaDoom」というゲームです。  
チーム制作ではあったものの様々な事情があり自分はプログラムと企画の大半を担当しました。  
結果、BitSummitのGameJam部門のゲームデザイン賞を頂きました。  
（ゲームシステムやルールが最も優れたゲームに送られる賞（全部で約20チーム））  
BitSummitで展示して感じたことはゲームをプレイする前から面白さが伝わるような企画が必要であると思い知りました。  
このゲームはある程度操作になれて最終ステージをクリアできるくらいになると面白さがしっかり伝わります。

## [布団ちゃんフィッシング](https://cluster.mu/w/db62ddec-6088-4017-ab77-e31180bc9460)

Clusterというメタバースプラットフォームのゲーム革命前夜というイベントで布団ちゃんに実況してもらうことを目指してゲームを作成しました。  
結果は布団ちゃんに実況してもらうことは叶いませんでしたが、ユースクリエーター賞の奨励賞をいただきました。  
Unity内のClusterCreatorsKitという新しいツールの勉強も含めて3週間という短い期間で頑張って完成させました。  
かなりプログラムの面で制約が強く、当初の企画通りにいかなかったことが悔やまれます。

## FlyShooting

宇宙空間を飛びながら宇宙ゴミを撃ってごみを片付けるゲーム。  
fpsゲームを自作してみたかった。  
面白い企画というより、fpsゲームのカメラやシューティングのプログラムを作ってみたかった。
UnityRoomにアップロードできたらUrlを載せます。
これも操作が難しく、バグも多い。一個前と同じ感じ。最悪反省。

## [賽は投げられた](https://unityroom.com/games/dicerun)

サイコロのそれぞれの面の特徴を生かして障害物を乗り越えてクリアするランゲームを制作しました。    
非常にバグが多く、操作も難しく、ステージも難しく作りすぎてしまったことを反省。

## [MenkoBattle](https://unityroom.com/games/menkobattle)

初めての3Dゲームです。  
コンセプトはカードゲームのような読み合いを楽しめるゲームを目指して作りました。  
ルールをゲーム内に付け忘れたのでここに書いときます。「盤面にある相手のキングカードを先にひっくり返した方が勝ち。」  
キングカードとは：名前の通り王様の絵が描かれためんこです。  
ゲーム性：  
めんこごとにめんこを叩きつけた時に発生する風が違って、指向性が強いため、どのめんこをひっくり返そうとしているのか分かりやすいです。  
相手は自分のキングのめんこをひっくり返さないようにめんこを叩きつけるため、キングの位置を推測するという読み合いができるんじゃないかなーと思って作りました。  
2人対戦とCOM戦が遊べます。気が向いたら改良するかもしれません。（コンピュータ戦はオプションボタン（M）をホームで押すと切り替えられます。）  
初めての3Dゲームの作成でめんこを操作している感じが弱いことをまず反省。

## [RatioPazle](./RatioPazleWebgl/)

一番初めに完成させたゲームです。  
コンセプトはモンストやパズドラのように直感的に楽しめるソーシャルゲームを目指して作りました。  
ルールはゲームのホーム画面の右上にある説明書とあるところから見れます。  
簡単に説明すると画面上に出てくる比にできるだけ近づくように色のついた球を動かして集めるゲームです。  
比が近ければ近いほど敵に与えるダメージが上がります。  
パズルゲームの最も大事な要素であるコンボの要素が抜けていることがまず反省。
